app/controllers/businesses_controller.rb

  def index
    @businesses = Business.all
---
SELECT * FROM `businesses`

  def show
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def edit
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def create
    @business = Business.new(params[:business])

    respond_to do |format|
      if @business.save
---
INSERT INTO `businesses` (`AddressLine1`, `AddressLine2`, `created_at`, `Name`, `updated_at`, `Review`, `Postcode`, `Suburb`, `State`) VALUES('Old Pittwater Rd', '', '2010-10-20 20:41:42', 'Community Engine', '2010-10-20 20:41:42', 'This is a sample business listing', '2096', 'Brookvale', 'NSW')

  def update
    params[:business][:feature_ids] ||= []
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)